xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxPort_bf.h
/** \brief Offset for Ifx_P_PDR0_Bits.PD6 */
#define IFX_P_PDR0_PD6_OFF (24u)

/** \brief Length for Ifx_P_PDR0_Bits.PL6 */
#define IFX_P_PDR0_PL6_LEN (2u)

/** \brief Mask for Ifx_P_PDR0_Bits.PL6 */
#define IFX_P_PDR0_PL6_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR0_Bits.PL6 */
#define IFX_P_PDR0_PL6_OFF (26u)

/** \brief Length for Ifx_P_PDR0_Bits.PD7 */
#define IFX_P_PDR0_PD7_LEN (2u)

/** \brief Mask for Ifx_P_PDR0_Bits.PD7 */
#define IFX_P_PDR0_PD7_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR0_Bits.PD7 */
#define IFX_P_PDR0_PD7_OFF (28u)

/** \brief Length for Ifx_P_PDR0_Bits.PL7 */
#define IFX_P_PDR0_PL7_LEN (2u)

/** \brief Mask for Ifx_P_PDR0_Bits.PL7 */
#define IFX_P_PDR0_PL7_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR0_Bits.PL7 */
#define IFX_P_PDR0_PL7_OFF (30u)

/** \brief Length for Ifx_P_PDR1_Bits.PD8 */
#define IFX_P_PDR1_PD8_LEN (2u)

/** \brief Mask for Ifx_P_PDR1_Bits.PD8 */
#define IFX_P_PDR1_PD8_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR1_Bits.PD8 */
#define IFX_P_PDR1_PD8_OFF (0u)

/** \brief Length for Ifx_P_PDR1_Bits.PL8 */
#define IFX_P_PDR1_PL8_LEN (2u)

/** \brief Mask for Ifx_P_PDR1_Bits.PL8 */
#define IFX_P_PDR1_PL8_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR1_Bits.PL8 */
#define IFX_P_PDR1_PL8_OFF (2u)

/** \brief Length for Ifx_P_PDR1_Bits.PD9 */
#define IFX_P_PDR1_PD9_LEN (2u)

/** \brief Mask for Ifx_P_PDR1_Bits.PD9 */
#define IFX_P_PDR1_PD9_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR1_Bits.PD9 */
#define IFX_P_PDR1_PD9_OFF (4u)

/** \brief Length for Ifx_P_PDR1_Bits.PL9 */
#define IFX_P_PDR1_PL9_LEN (2u)

/** \brief Mask for Ifx_P_PDR1_Bits.PL9 */
#define IFX_P_PDR1_PL9_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR1_Bits.PL9 */
#define IFX_P_PDR1_PL9_OFF (6u)

/** \brief Length for Ifx_P_PDR1_Bits.PD10 */
#define IFX_P_PDR1_PD10_LEN (2u)

/** \brief Mask for Ifx_P_PDR1_Bits.PD10 */
#define IFX_P_PDR1_PD10_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR1_Bits.PD10 */
#define IFX_P_PDR1_PD10_OFF (8u)

/** \brief Length for Ifx_P_PDR1_Bits.PL10 */
#define IFX_P_PDR1_PL10_LEN (2u)

/** \brief Mask for Ifx_P_PDR1_Bits.PL10 */
#define IFX_P_PDR1_PL10_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR1_Bits.PL10 */
#define IFX_P_PDR1_PL10_OFF (10u)

/** \brief Length for Ifx_P_PDR1_Bits.PD11 */
#define IFX_P_PDR1_PD11_LEN (2u)

/** \brief Mask for Ifx_P_PDR1_Bits.PD11 */
#define IFX_P_PDR1_PD11_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR1_Bits.PD11 */
#define IFX_P_PDR1_PD11_OFF (12u)

/** \brief Length for Ifx_P_PDR1_Bits.PL11 */
#define IFX_P_PDR1_PL11_LEN (2u)

/** \brief Mask for Ifx_P_PDR1_Bits.PL11 */
#define IFX_P_PDR1_PL11_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR1_Bits.PL11 */
#define IFX_P_PDR1_PL11_OFF (14u)

/** \brief Length for Ifx_P_PDR1_Bits.PD12 */
#define IFX_P_PDR1_PD12_LEN (2u)

/** \brief Mask for Ifx_P_PDR1_Bits.PD12 */
#define IFX_P_PDR1_PD12_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR1_Bits.PD12 */
#define IFX_P_PDR1_PD12_OFF (16u)

/** \brief Length for Ifx_P_PDR1_Bits.PL12 */
#define IFX_P_PDR1_PL12_LEN (2u)

/** \brief Mask for Ifx_P_PDR1_Bits.PL12 */
#define IFX_P_PDR1_PL12_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR1_Bits.PL12 */
#define IFX_P_PDR1_PL12_OFF (18u)

/** \brief Length for Ifx_P_PDR1_Bits.PD13 */
#define IFX_P_PDR1_PD13_LEN (2u)

/** \brief Mask for Ifx_P_PDR1_Bits.PD13 */
#define IFX_P_PDR1_PD13_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR1_Bits.PD13 */
#define IFX_P_PDR1_PD13_OFF (20u)

/** \brief Length for Ifx_P_PDR1_Bits.PL13 */
#define IFX_P_PDR1_PL13_LEN (2u)

/** \brief Mask for Ifx_P_PDR1_Bits.PL13 */
#define IFX_P_PDR1_PL13_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR1_Bits.PL13 */
#define IFX_P_PDR1_PL13_OFF (22u)

/** \brief Length for Ifx_P_PDR1_Bits.PD14 */
#define IFX_P_PDR1_PD14_LEN (2u)

/** \brief Mask for Ifx_P_PDR1_Bits.PD14 */
#define IFX_P_PDR1_PD14_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR1_Bits.PD14 */
#define IFX_P_PDR1_PD14_OFF (24u)

/** \brief Length for Ifx_P_PDR1_Bits.PL14 */
#define IFX_P_PDR1_PL14_LEN (2u)

/** \brief Mask for Ifx_P_PDR1_Bits.PL14 */
#define IFX_P_PDR1_PL14_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR1_Bits.PL14 */
#define IFX_P_PDR1_PL14_OFF (26u)

/** \brief Length for Ifx_P_PDR1_Bits.PD15 */
#define IFX_P_PDR1_PD15_LEN (2u)

/** \brief Mask for Ifx_P_PDR1_Bits.PD15 */
#define IFX_P_PDR1_PD15_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR1_Bits.PD15 */
#define IFX_P_PDR1_PD15_OFF (28u)

/** \brief Length for Ifx_P_PDR1_Bits.PL15 */
#define IFX_P_PDR1_PL15_LEN (2u)

/** \brief Mask for Ifx_P_PDR1_Bits.PL15 */
#define IFX_P_PDR1_PL15_MSK (0x3u)

/** \brief Offset for Ifx_P_PDR1_Bits.PL15 */
#define IFX_P_PDR1_PL15_OFF (30u)

/** \brief Length for Ifx_P_ESR_Bits.EN0 */
#define IFX_P_ESR_EN0_LEN (1u)

/** \brief Mask for Ifx_P_ESR_Bits.EN0 */
#define IFX_P_ESR_EN0_MSK (0x1u)

/** \brief Offset for Ifx_P_ESR_Bits.EN0 */
#define IFX_P_ESR_EN0_OFF (0u)

/** \brief Length for Ifx_P_ESR_Bits.EN1 */
#define IFX_P_ESR_EN1_LEN (1u)

/** \brief Mask for Ifx_P_ESR_Bits.EN1 */
#define IFX_P_ESR_EN1_MSK (0x1u)

/** \brief Offset for Ifx_P_ESR_Bits.EN1 */
#define IFX_P_ESR_EN1_OFF (1u)

/** \brief Length for Ifx_P_ESR_Bits.EN2 */
#define IFX_P_ESR_EN2_LEN (1u)

/** \brief Mask for Ifx_P_ESR_Bits.EN2 */
#define IFX_P_ESR_EN2_MSK (0x1u)

/** \brief Offset for Ifx_P_ESR_Bits.EN2 */
#define IFX_P_ESR_EN2_OFF (2u)

/** \brief Length for Ifx_P_ESR_Bits.EN3 */
#define IFX_P_ESR_EN3_LEN (1u)

/** \brief Mask for Ifx_P_ESR_Bits.EN3 */
#define IFX_P_ESR_EN3_MSK (0x1u)

/** \brief Offset for Ifx_P_ESR_Bits.EN3 */
#define IFX_P_ESR_EN3_OFF (3u)

/** \brief Length for Ifx_P_ESR_Bits.EN4 */
#define IFX_P_ESR_EN4_LEN (1u)

/** \brief Mask for Ifx_P_ESR_Bits.EN4 */
#define IFX_P_ESR_EN4_MSK (0x1u)

/** \brief Offset for Ifx_P_ESR_Bits.EN4 */
#define IFX_P_ESR_EN4_OFF (4u)

/** \brief Length for Ifx_P_ESR_Bits.EN5 */
#define IFX_P_ESR_EN5_LEN (1u)

/** \brief Mask for Ifx_P_ESR_Bits.EN5 */
#define IFX_P_ESR_EN5_MSK (0x1u)

/** \brief Offset for Ifx_P_ESR_Bits.EN5 */
#define IFX_P_ESR_EN5_OFF (5u)

/** \brief Length for Ifx_P_ESR_Bits.EN6 */
#define IFX_P_ESR_EN6_LEN (1u)

/** \brief Mask for Ifx_P_ESR_Bits.EN6 */
#define IFX_P_ESR_EN6_MSK (0x1u)

/** \brief Offset for Ifx_P_ESR_Bits.EN6 */
#define IFX_P_ESR_EN6_OFF (6u)

