xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxPort_bf.h
/** \brief Length for Ifx_P_OMCR_Bits.PCL12 */
#define IFX_P_OMCR_PCL12_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL12 */
#define IFX_P_OMCR_PCL12_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL12 */
#define IFX_P_OMCR_PCL12_OFF (28u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL13 */
#define IFX_P_OMCR_PCL13_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL13 */
#define IFX_P_OMCR_PCL13_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL13 */
#define IFX_P_OMCR_PCL13_OFF (29u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL14 */
#define IFX_P_OMCR_PCL14_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL14 */
#define IFX_P_OMCR_PCL14_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL14 */
#define IFX_P_OMCR_PCL14_OFF (30u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL15 */
#define IFX_P_OMCR_PCL15_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL15 */
#define IFX_P_OMCR_PCL15_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL15 */
#define IFX_P_OMCR_PCL15_OFF (31u)

/** \brief Length for Ifx_P_LPCR_Bits.REN_CTRL */
#define IFX_P_LPCR_REN_CTRL_LEN (1u)

/** \brief Mask for Ifx_P_LPCR_Bits.REN_CTRL */
#define IFX_P_LPCR_REN_CTRL_MSK (0x1u)

/** \brief Offset for Ifx_P_LPCR_Bits.REN_CTRL */
#define IFX_P_LPCR_REN_CTRL_OFF (0u)

/** \brief Length for Ifx_P_LPCR_Bits.RX_EN */
#define IFX_P_LPCR_RX_EN_LEN (1u)

/** \brief Mask for Ifx_P_LPCR_Bits.RX_EN */
#define IFX_P_LPCR_RX_EN_MSK (0x1u)

/** \brief Offset for Ifx_P_LPCR_Bits.RX_EN */
#define IFX_P_LPCR_RX_EN_OFF (1u)

/** \brief Length for Ifx_P_LPCR_Bits.TERM */
#define IFX_P_LPCR_TERM_LEN (1u)

/** \brief Mask for Ifx_P_LPCR_Bits.TERM */
#define IFX_P_LPCR_TERM_MSK (0x1u)

/** \brief Offset for Ifx_P_LPCR_Bits.TERM */
#define IFX_P_LPCR_TERM_OFF (2u)

/** \brief Length for Ifx_P_LPCR_Bits.LRXTERM */
#define IFX_P_LPCR_LRXTERM_LEN (3u)

/** \brief Mask for Ifx_P_LPCR_Bits.LRXTERM */
#define IFX_P_LPCR_LRXTERM_MSK (0x7u)

/** \brief Offset for Ifx_P_LPCR_Bits.LRXTERM */
#define IFX_P_LPCR_LRXTERM_OFF (3u)

/** \brief Length for Ifx_P_LPCR_Bits.LVDSM */
#define IFX_P_LPCR_LVDSM_LEN (1u)

/** \brief Mask for Ifx_P_LPCR_Bits.LVDSM */
#define IFX_P_LPCR_LVDSM_MSK (0x1u)

/** \brief Offset for Ifx_P_LPCR_Bits.LVDSM */
#define IFX_P_LPCR_LVDSM_OFF (6u)

/** \brief Length for Ifx_P_LPCR_Bits.PS */
#define IFX_P_LPCR_PS_LEN (1u)

/** \brief Mask for Ifx_P_LPCR_Bits.PS */
#define IFX_P_LPCR_PS_MSK (0x1u)

/** \brief Offset for Ifx_P_LPCR_Bits.PS */
#define IFX_P_LPCR_PS_OFF (7u)

/** \brief Length for Ifx_P_LPCR_Bits.TEN_CTRL */
#define IFX_P_LPCR_TEN_CTRL_LEN (1u)

/** \brief Mask for Ifx_P_LPCR_Bits.TEN_CTRL */
#define IFX_P_LPCR_TEN_CTRL_MSK (0x1u)

/** \brief Offset for Ifx_P_LPCR_Bits.TEN_CTRL */
#define IFX_P_LPCR_TEN_CTRL_OFF (8u)

/** \brief Length for Ifx_P_LPCR_Bits.TX_EN */
#define IFX_P_LPCR_TX_EN_LEN (1u)

/** \brief Mask for Ifx_P_LPCR_Bits.TX_EN */
#define IFX_P_LPCR_TX_EN_MSK (0x1u)

/** \brief Offset for Ifx_P_LPCR_Bits.TX_EN */
#define IFX_P_LPCR_TX_EN_OFF (9u)

/** \brief Length for Ifx_P_LPCR_Bits.VDIFFADJ */
#define IFX_P_LPCR_VDIFFADJ_LEN (2u)

/** \brief Mask for Ifx_P_LPCR_Bits.VDIFFADJ */
#define IFX_P_LPCR_VDIFFADJ_MSK (0x3u)

/** \brief Offset for Ifx_P_LPCR_Bits.VDIFFADJ */
#define IFX_P_LPCR_VDIFFADJ_OFF (10u)

/** \brief Length for Ifx_P_LPCR_Bits.VOSDYN */
#define IFX_P_LPCR_VOSDYN_LEN (1u)

/** \brief Mask for Ifx_P_LPCR_Bits.VOSDYN */
#define IFX_P_LPCR_VOSDYN_MSK (0x1u)

/** \brief Offset for Ifx_P_LPCR_Bits.VOSDYN */
#define IFX_P_LPCR_VOSDYN_OFF (12u)

/** \brief Length for Ifx_P_LPCR_Bits.VOSEXT */
#define IFX_P_LPCR_VOSEXT_LEN (1u)

/** \brief Mask for Ifx_P_LPCR_Bits.VOSEXT */
#define IFX_P_LPCR_VOSEXT_MSK (0x1u)

/** \brief Offset for Ifx_P_LPCR_Bits.VOSEXT */
#define IFX_P_LPCR_VOSEXT_OFF (13u)

/** \brief Length for Ifx_P_LPCR_Bits.TX_PD */
#define IFX_P_LPCR_TX_PD_LEN (1u)

/** \brief Mask for Ifx_P_LPCR_Bits.TX_PD */
#define IFX_P_LPCR_TX_PD_MSK (0x1u)

/** \brief Offset for Ifx_P_LPCR_Bits.TX_PD */
#define IFX_P_LPCR_TX_PD_OFF (14u)

/** \brief Length for Ifx_P_LPCR_Bits.TX_PWDPD */
#define IFX_P_LPCR_TX_PWDPD_LEN (1u)

/** \brief Mask for Ifx_P_LPCR_Bits.TX_PWDPD */
#define IFX_P_LPCR_TX_PWDPD_MSK (0x1u)

/** \brief Offset for Ifx_P_LPCR_Bits.TX_PWDPD */
#define IFX_P_LPCR_TX_PWDPD_OFF (15u)

/** \brief Length for Ifx_P_ACCEN0_Bits.EN0 */
#define IFX_P_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_P_ACCEN0_Bits.EN0 */
#define IFX_P_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_P_ACCEN0_Bits.EN0 */
#define IFX_P_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_P_ACCEN0_Bits.EN1 */
#define IFX_P_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_P_ACCEN0_Bits.EN1 */
#define IFX_P_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_P_ACCEN0_Bits.EN1 */
#define IFX_P_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_P_ACCEN0_Bits.EN2 */
#define IFX_P_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_P_ACCEN0_Bits.EN2 */
#define IFX_P_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_P_ACCEN0_Bits.EN2 */
#define IFX_P_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_P_ACCEN0_Bits.EN3 */
#define IFX_P_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_P_ACCEN0_Bits.EN3 */
#define IFX_P_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_P_ACCEN0_Bits.EN3 */
#define IFX_P_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_P_ACCEN0_Bits.EN4 */
#define IFX_P_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_P_ACCEN0_Bits.EN4 */
#define IFX_P_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_P_ACCEN0_Bits.EN4 */
#define IFX_P_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_P_ACCEN0_Bits.EN5 */
#define IFX_P_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_P_ACCEN0_Bits.EN5 */
#define IFX_P_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_P_ACCEN0_Bits.EN5 */
#define IFX_P_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_P_ACCEN0_Bits.EN6 */
#define IFX_P_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_P_ACCEN0_Bits.EN6 */
#define IFX_P_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_P_ACCEN0_Bits.EN6 */
#define IFX_P_ACCEN0_EN6_OFF (6u)

/** \brief Length for Ifx_P_ACCEN0_Bits.EN7 */
#define IFX_P_ACCEN0_EN7_LEN (1u)

